; domain
(define (domain knight)
  (:requirements :strips :negative-preconditions :equality)
  (:predicates
    (at ?p ?x ?y)
    (occupied ?x ?y)
    (delta1 ?y1 ?y2)  ; separated by 1 square (adjacent)
    (delta2 ?y1 ?y2)  ; separated by 2 squares
  )
  (:action move
      :parameters (?p ?x1 ?y1 ?x2 ?y2)
      :precondition (and
        (at ?p ?x1 ?y1)
        (not (occupied ?x2 ?y2))
        (or
          (and (delta1 ?x1 ?x2) (delta2 ?y1 ?y2))
          (and (delta1 ?y1 ?y2) (delta2 ?x1 ?x2))
        )
      )
      :effect (and 
        (not (at ?p ?x1 ?y1))
            (at ?p ?x2 ?y2)
            (occupied ?x2 ?y2)
        (not (occupied ?x1 ?y1))
      )
  )
)

; problem
(define (problem simple-knight-problem) 
  (:domain knight)
  (:objects
      knight
      x1 x2 x3 x4 x5 x6 x7
      y1 y2 y3 y4 y5 y6 y7 y8
  )

  (:init
    (at knight x1 y1)
    (occupied x2 y3)
    (occupied x6 y6)

    ; x delta1
    (delta1 x1 x2)
    (delta1 x2 x3)
    (delta1 x3 x4)
    (delta1 x4 x5)
    (delta1 x5 x6)
    (delta1 x6 x7)
    ; x delta1 inverse
    (delta1 x2 x1)
    (delta1 x3 x2)
    (delta1 x4 x3)
    (delta1 x5 x4)
    (delta1 x6 x5)
    (delta1 x7 x6)
    ; x delta2
    (delta2 x1 x3)
    (delta2 x2 x4)
    (delta2 x3 x5)
    (delta2 x4 x6)
    (delta2 x5 x7)
    ; x delta 2 inverse
    (delta2 x3 x1)
    (delta2 x4 x2)
    (delta2 x5 x3)
    (delta2 x6 x4)
    (delta2 x7 x5)

    ; y delta1
    (delta1 y1 y2)
    (delta1 y2 y3)
    (delta1 y3 y4)
    (delta1 y4 y5)
    (delta1 y5 y6)
    (delta1 y6 y7)
    (delta1 y7 y8)
    ; y delta1 inverse
    (delta1 y2 y1)
    (delta1 y3 y2)
    (delta1 y4 y3)
    (delta1 y5 y4)
    (delta1 y6 y5)
    (delta1 y7 y6)
    (delta1 y8 y7)
    ; y delta2
    (delta2 y1 y3)
    (delta2 y2 y4)
    (delta2 y3 y5)
    (delta2 y4 y6)
    (delta2 y5 y7)
    (delta2 y6 y8)
    ; y delta2 inverse
    (delta2 y3 y1)
    (delta2 y4 y2)
    (delta2 y5 y3)
    (delta2 y6 y4)
    (delta2 y7 y5)
    (delta2 y8 y6)
  )

  (:goal 
      (at knight x7 y8)
  )
)

; plan
1. (move knight x1 y1 x3 y2)
   deleted: (at knight x1 y1)
   added: (at knight x3 y2) (occupied x3 y2)
   goals met: 0 of 1
2. (move knight x3 y2 x4 y4)
   deleted: (at knight x3 y2) (occupied x3 y2)
   added: (at knight x4 y4) (occupied x4 y4)
   goals met: 0 of 1
3. (move knight x4 y4 x6 y5)
   deleted: (at knight x4 y4) (occupied x4 y4)
   added: (at knight x6 y5) (occupied x6 y5)
   goals met: 0 of 1
4. (move knight x6 y5 x5 y7)
   deleted: (at knight x6 y5) (occupied x6 y5)
   added: (at knight x5 y7) (occupied x5 y7)
   goals met: 0 of 1
5. (move knight x5 y7 x7 y8)
   deleted: (at knight x5 y7) (occupied x5 y7)
   added: (at knight x7 y8) (occupied x7 y8)
   goals met: 1 of 1
